[
  {
    "id": "52dae53e-605a-40b7-aabc-61e93be00ff8",
    "title": "The quick brown.",
    "slug": "the-quick-brown",
    "excerpt": "The quick brown fox jumps over lazy. The quick brown fox jumps over lazy.",
    "content": "The quick brown fox jumps over lazy. The quick brown. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown fox. The quick brown fox jumps over. The quick brown fox jumps.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy. The quick brown fox jumps.\n\nThe quick brown fox. The quick brown fox. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over. The quick brown fox jumps. The quick brown fox jumps over lazy.\n\nThe quick brown fox. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy. The quick brown fox.",
    "author": "Charlie Brown",
    "publishedAt": "2024-02-28T00:51:45.947Z",
    "image": "https://via.placeholder.com/800x400/4bd6d2/FFFFFF?text=The%20quick%20brown.",
    "category": "ai-llm-rag",
    "tags": [
      "react",
      "devops",
      "api",
      "performance"
    ],
    "views": 2185,
    "likes": 333
  },
  {
    "id": "36481499-992c-4bd9-bbea-9c7de3f250f6",
    "title": "The quick brown fox jumps.",
    "slug": "the-quick-brown-fox-jumps",
    "excerpt": "The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog.",
    "content": "The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown fox. The quick brown fox. The quick brown fox jumps.\n\nThe quick brown fox jumps over lazy. The quick brown fox. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over. The quick brown. The quick brown.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over. The quick brown fox jumps.\n\nThe quick brown fox jumps over. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy. The quick brown. The quick brown fox.\n\nThe quick brown fox jumps over. The quick brown fox. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy. The quick brown.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over. The quick brown fox. The quick brown.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown fox jumps.",
    "author": "Charlie Brown",
    "publishedAt": "2024-01-29T07:52:34.156Z",
    "image": "https://via.placeholder.com/800x400/46c5c8/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "web-development",
    "tags": [
      "frontend",
      "cloud"
    ],
    "views": 7000,
    "likes": 142
  },
  {
    "id": "3b141ddf-2648-474f-88eb-d9d10ce85289",
    "title": "The quick brown fox jumps over.",
    "slug": "the-quick-brown-fox-jumps-over",
    "excerpt": "The quick brown fox jumps over lazy. The quick brown.",
    "content": "The quick brown fox jumps. The quick brown fox jumps over lazy. The quick brown.\n\nThe quick brown fox jumps. The quick brown fox jumps over. The quick brown fox jumps over lazy.\n\nThe quick brown. The quick brown fox jumps over. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy. The quick brown fox. The quick brown fox jumps.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy. The quick brown.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown fox jumps over. The quick brown fox jumps. The quick brown.\n\nThe quick brown fox. The quick brown fox. The quick brown fox jumps.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox. The quick brown fox.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.\n\nThe quick brown fox. The quick brown fox jumps over. The quick brown.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps. The quick brown fox jumps.\n\nThe quick brown. The quick brown. The quick brown.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog. The quick brown fox.",
    "author": "Alice Johnson",
    "publishedAt": "2025-09-16T01:11:10.758Z",
    "image": "https://via.placeholder.com/800x400/7df865/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "web-development",
    "tags": [
      "javascript",
      "frontend",
      "react"
    ],
    "views": 9927,
    "likes": 496
  },
  {
    "id": "85fc5d59-d875-48a5-bdd1-0ff544a52b0b",
    "title": "The quick brown fox jumps.",
    "slug": "the-quick-brown-fox-jumps",
    "excerpt": "The quick brown fox jumps over lazy. The quick brown fox.",
    "content": "The quick brown. The quick brown. The quick brown fox jumps.\n\nThe quick brown fox jumps over. The quick brown. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown fox. The quick brown fox jumps. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps. The quick brown fox jumps over. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown.\n\nThe quick brown fox jumps. The quick brown fox jumps. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps. The quick brown. The quick brown fox jumps over.",
    "author": "Bob Wilson",
    "publishedAt": "2024-06-19T23:00:43.441Z",
    "image": "https://via.placeholder.com/800x400/4a01ec/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "databases",
    "tags": [
      "frontend",
      "cloud",
      "machine-learning",
      "typescript"
    ],
    "views": 8595,
    "likes": 107
  },
  {
    "id": "9fecc312-a7bb-4676-9eae-6fe9940428b1",
    "title": "The quick brown fox.",
    "slug": "the-quick-brown-fox",
    "excerpt": "The quick brown. The quick brown fox jumps.",
    "content": "The quick brown fox jumps over lazy. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy. The quick brown fox.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown fox.\n\nThe quick brown. The quick brown fox jumps over. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy. The quick brown fox.\n\nThe quick brown fox. The quick brown fox jumps over lazy dog. The quick brown fox.",
    "author": "Charlie Brown",
    "publishedAt": "2024-12-16T12:33:10.298Z",
    "image": "https://via.placeholder.com/800x400/72041f/FFFFFF?text=The%20quick%20brown%20fox.",
    "category": "web-development",
    "tags": [
      "backend",
      "performance",
      "frontend"
    ],
    "views": 5872,
    "likes": 482
  },
  {
    "id": "ce4c706f-1887-41da-af85-2e1bd49c1059",
    "title": "The quick brown fox jumps over lazy dog.",
    "slug": "the-quick-brown-fox-jumps-over-lazy-dog",
    "excerpt": "The quick brown. The quick brown fox jumps.",
    "content": "The quick brown fox. The quick brown fox jumps. The quick brown.\n\nThe quick brown fox jumps over lazy dog. The quick brown. The quick brown fox.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy. The quick brown fox jumps.\n\nThe quick brown fox. The quick brown fox jumps over lazy. The quick brown fox.\n\nThe quick brown fox jumps over. The quick brown fox jumps over. The quick brown fox jumps over.\n\nThe quick brown. The quick brown fox jumps. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy. The quick brown fox jumps.\n\nThe quick brown. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.\n\nThe quick brown. The quick brown. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox. The quick brown. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy. The quick brown fox. The quick brown fox jumps.",
    "author": "Alice Johnson",
    "publishedAt": "2025-04-19T14:08:07.851Z",
    "image": "https://via.placeholder.com/800x400/a61210/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "web-development",
    "tags": [
      "performance",
      "devops"
    ],
    "views": 1216,
    "likes": 279
  },
  {
    "id": "df509083-7b1a-4397-aa90-c3a455721e3b",
    "title": "The quick brown fox jumps over lazy.",
    "slug": "the-quick-brown-fox-jumps-over-lazy",
    "excerpt": "The quick brown fox jumps over. The quick brown fox jumps over.",
    "content": "The quick brown fox jumps. The quick brown. The quick brown.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy. The quick brown fox.\n\nThe quick brown fox. The quick brown fox jumps over lazy. The quick brown fox jumps.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over. The quick brown. The quick brown fox jumps over.\n\nThe quick brown fox. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.",
    "author": "John Doe",
    "publishedAt": "2025-07-04T11:11:07.116Z",
    "image": "https://via.placeholder.com/800x400/5b7056/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "news",
    "tags": [
      "mongodb",
      "api",
      "database"
    ],
    "views": 7445,
    "likes": 499
  },
  {
    "id": "4b49d856-993d-4a10-8b15-4f770bfb4e04",
    "title": "The quick brown.",
    "slug": "the-quick-brown",
    "excerpt": "The quick brown fox jumps over lazy dog. The quick brown.",
    "content": "The quick brown fox jumps over. The quick brown. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over. The quick brown fox jumps over. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy. The quick brown fox. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy.",
    "author": "John Doe",
    "publishedAt": "2025-09-30T08:06:37.123Z",
    "image": "https://via.placeholder.com/800x400/a95fae/FFFFFF?text=The%20quick%20brown.",
    "category": "ai-llm-rag",
    "tags": [
      "mongodb",
      "security",
      "backend",
      "web-development",
      "database"
    ],
    "views": 470,
    "likes": 208
  },
  {
    "id": "23935066-01cb-47ee-9380-c000781fcc14",
    "title": "The quick brown.",
    "slug": "the-quick-brown",
    "excerpt": "The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog.",
    "content": "The quick brown fox. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps. The quick brown. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox. The quick brown fox jumps over. The quick brown fox jumps over lazy.\n\nThe quick brown fox. The quick brown fox jumps over lazy dog. The quick brown.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over. The quick brown fox.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown.\n\nThe quick brown. The quick brown. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy. The quick brown fox.\n\nThe quick brown fox jumps. The quick brown fox jumps over. The quick brown fox jumps over lazy dog.\n\nThe quick brown. The quick brown fox jumps over lazy dog. The quick brown fox jumps.\n\nThe quick brown fox. The quick brown fox jumps over. The quick brown fox jumps over.\n\nThe quick brown fox. The quick brown fox jumps. The quick brown fox.",
    "author": "Alice Johnson",
    "publishedAt": "2024-08-09T13:29:31.708Z",
    "image": "https://via.placeholder.com/800x400/f7030a/FFFFFF?text=The%20quick%20brown.",
    "category": "ai-llm-rag",
    "tags": [
      "machine-learning",
      "frontend",
      "security",
      "cloud",
      "backend"
    ],
    "views": 5893,
    "likes": 188
  },
  {
    "id": "e3dc6cb8-2b5c-447a-9fbf-b6eb0c7e40e6",
    "title": "The quick brown fox jumps over lazy dog.",
    "slug": "the-quick-brown-fox-jumps-over-lazy-dog",
    "excerpt": "The quick brown fox jumps over. The quick brown fox jumps over.",
    "content": "The quick brown fox jumps over lazy dog. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown fox. The quick brown fox jumps over. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy dog. The quick brown. The quick brown fox jumps over.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps. The quick brown fox jumps over. The quick brown fox.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over. The quick brown. The quick brown fox jumps.",
    "author": "John Doe",
    "publishedAt": "2024-10-18T08:02:00.596Z",
    "image": "https://via.placeholder.com/800x400/be1bdf/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "ai-llm-rag",
    "tags": [
      "devops",
      "ai",
      "performance"
    ],
    "views": 5038,
    "likes": 264
  },
  {
    "id": "c38b395a-033c-4efd-8a98-1bf5c126f9a2",
    "title": "The quick brown fox.",
    "slug": "the-quick-brown-fox",
    "excerpt": "The quick brown fox jumps over lazy dog. The quick brown fox.",
    "content": "The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog. The quick brown fox jumps.\n\nThe quick brown fox. The quick brown fox. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown fox. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps. The quick brown. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy dog. The quick brown. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox. The quick brown fox jumps over. The quick brown fox jumps over lazy.\n\nThe quick brown fox. The quick brown fox jumps over. The quick brown fox jumps.\n\nThe quick brown fox jumps over. The quick brown fox jumps. The quick brown fox jumps over.\n\nThe quick brown. The quick brown fox jumps over lazy dog. The quick brown.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over. The quick brown.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps. The quick brown fox jumps over. The quick brown fox.",
    "author": "John Doe",
    "publishedAt": "2024-08-08T22:29:38.398Z",
    "image": "https://via.placeholder.com/800x400/73f3c7/FFFFFF?text=The%20quick%20brown%20fox.",
    "category": "news",
    "tags": [
      "cloud",
      "mongodb",
      "typescript"
    ],
    "views": 8344,
    "likes": 378
  },
  {
    "id": "a582f703-1e0b-4d93-9e59-fa170f7f0556",
    "title": "The quick brown fox jumps over lazy dog.",
    "slug": "the-quick-brown-fox-jumps-over-lazy-dog",
    "excerpt": "The quick brown fox jumps over lazy. The quick brown fox jumps over.",
    "content": "The quick brown fox jumps. The quick brown. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy. The quick brown fox.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy dog. The quick brown. The quick brown.\n\nThe quick brown fox jumps. The quick brown fox. The quick brown fox.\n\nThe quick brown. The quick brown. The quick brown fox jumps over.\n\nThe quick brown fox. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown fox jumps over. The quick brown fox jumps. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over. The quick brown fox. The quick brown fox jumps over lazy.",
    "author": "Bob Wilson",
    "publishedAt": "2025-05-26T19:32:21.874Z",
    "image": "https://via.placeholder.com/800x400/867d3/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "news",
    "tags": [
      "web-development",
      "react",
      "javascript"
    ],
    "views": 7161,
    "likes": 167
  },
  {
    "id": "7946cf30-3578-40d0-a005-6a5bc69d7de1",
    "title": "The quick brown fox jumps over lazy dog.",
    "slug": "the-quick-brown-fox-jumps-over-lazy-dog",
    "excerpt": "The quick brown fox jumps over lazy dog. The quick brown fox jumps.",
    "content": "The quick brown fox. The quick brown fox jumps over. The quick brown fox.\n\nThe quick brown fox jumps. The quick brown fox. The quick brown fox jumps.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown fox. The quick brown. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown fox jumps.\n\nThe quick brown fox jumps over. The quick brown fox jumps over. The quick brown fox jumps over lazy dog.",
    "author": "John Doe",
    "publishedAt": "2024-07-10T23:13:09.198Z",
    "image": "https://via.placeholder.com/800x400/d3fd4f/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "frontend-backend",
    "tags": [
      "javascript",
      "typescript"
    ],
    "views": 8015,
    "likes": 223
  },
  {
    "id": "fcc75fb5-6cbd-409e-894c-b289742e237d",
    "title": "The quick brown fox jumps over lazy.",
    "slug": "the-quick-brown-fox-jumps-over-lazy",
    "excerpt": "The quick brown fox. The quick brown fox jumps over.",
    "content": "The quick brown fox jumps over. The quick brown fox jumps over. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.\n\nThe quick brown fox jumps over. The quick brown fox. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over. The quick brown fox jumps over. The quick brown fox jumps.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown. The quick brown fox jumps. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown fox jumps. The quick brown.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over. The quick brown fox.\n\nThe quick brown. The quick brown fox jumps over. The quick brown fox jumps.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps. The quick brown fox jumps over. The quick brown.\n\nThe quick brown. The quick brown fox jumps over lazy dog. The quick brown fox.",
    "author": "Jane Smith",
    "publishedAt": "2025-06-24T20:13:34.129Z",
    "image": "https://via.placeholder.com/800x400/19376a/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "web-development",
    "tags": [
      "react",
      "nextjs",
      "devops",
      "javascript",
      "security"
    ],
    "views": 5112,
    "likes": 322
  },
  {
    "id": "7f712324-6b4a-426a-911b-fc0aff60c31f",
    "title": "The quick brown fox jumps.",
    "slug": "the-quick-brown-fox-jumps",
    "excerpt": "The quick brown. The quick brown fox jumps over.",
    "content": "The quick brown fox jumps. The quick brown. The quick brown.\n\nThe quick brown. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps. The quick brown.\n\nThe quick brown fox jumps over lazy. The quick brown fox. The quick brown fox jumps.\n\nThe quick brown fox jumps over. The quick brown fox. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over. The quick brown fox jumps over. The quick brown fox.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps. The quick brown fox.\n\nThe quick brown fox jumps over lazy dog. The quick brown. The quick brown fox jumps.\n\nThe quick brown fox jumps over lazy. The quick brown. The quick brown fox jumps over lazy.",
    "author": "Bob Wilson",
    "publishedAt": "2024-02-05T07:32:44.526Z",
    "image": "https://via.placeholder.com/800x400/492787/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "web-development",
    "tags": [
      "testing",
      "typescript"
    ],
    "views": 186,
    "likes": 211
  },
  {
    "id": "c55be0bf-7b2b-4767-a228-71f34c59a060",
    "title": "The quick brown fox.",
    "slug": "the-quick-brown-fox",
    "excerpt": "The quick brown fox. The quick brown fox jumps over lazy dog.",
    "content": "The quick brown fox jumps over. The quick brown fox jumps over lazy dog. The quick brown fox jumps.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy. The quick brown.\n\nThe quick brown. The quick brown fox jumps over. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.\n\nThe quick brown fox. The quick brown. The quick brown fox jumps over lazy.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy.\n\nThe quick brown fox. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy. The quick brown fox jumps.\n\nThe quick brown fox jumps. The quick brown. The quick brown fox.\n\nThe quick brown fox. The quick brown. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown. The quick brown fox jumps. The quick brown fox jumps.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps. The quick brown fox jumps.\n\nThe quick brown fox jumps. The quick brown fox jumps. The quick brown.",
    "author": "Alice Johnson",
    "publishedAt": "2025-02-24T23:56:42.339Z",
    "image": "https://via.placeholder.com/800x400/5daada/FFFFFF?text=The%20quick%20brown%20fox.",
    "category": "news",
    "tags": [
      "machine-learning",
      "devops",
      "frontend",
      "web-development"
    ],
    "views": 1970,
    "likes": 196
  },
  {
    "id": "ef7259cf-31d7-4f31-905d-66e82e36de9c",
    "title": "The quick brown fox jumps over lazy dog.",
    "slug": "the-quick-brown-fox-jumps-over-lazy-dog",
    "excerpt": "The quick brown fox jumps over. The quick brown.",
    "content": "The quick brown fox jumps over lazy. The quick brown fox jumps over. The quick brown fox jumps.\n\nThe quick brown fox jumps over. The quick brown. The quick brown fox jumps.\n\nThe quick brown fox. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over. The quick brown fox jumps.\n\nThe quick brown. The quick brown fox jumps over. The quick brown fox.",
    "author": "Charlie Brown",
    "publishedAt": "2024-07-15T06:29:01.630Z",
    "image": "https://via.placeholder.com/800x400/15e524/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "frontend-backend",
    "tags": [
      "frontend",
      "performance",
      "design"
    ],
    "views": 7838,
    "likes": 241
  },
  {
    "id": "4f0e19bd-7ac6-4f30-a54f-1b8cbf4a4c59",
    "title": "The quick brown fox jumps over lazy dog.",
    "slug": "the-quick-brown-fox-jumps-over-lazy-dog",
    "excerpt": "The quick brown fox jumps. The quick brown.",
    "content": "The quick brown fox. The quick brown fox jumps over. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown. The quick brown.\n\nThe quick brown fox jumps over lazy. The quick brown. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown fox. The quick brown.\n\nThe quick brown fox jumps over. The quick brown fox jumps over. The quick brown.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown fox. The quick brown fox jumps. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy dog. The quick brown. The quick brown fox.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy. The quick brown.",
    "author": "Jane Smith",
    "publishedAt": "2024-03-21T21:09:17.143Z",
    "image": "https://via.placeholder.com/800x400/7c4aa0/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "ai-llm-rag",
    "tags": [
      "performance",
      "testing",
      "frontend"
    ],
    "views": 4425,
    "likes": 404
  },
  {
    "id": "fdfd09a1-92c6-4dca-a323-3018a14b7bc4",
    "title": "The quick brown fox.",
    "slug": "the-quick-brown-fox",
    "excerpt": "The quick brown fox jumps over lazy. The quick brown fox jumps over lazy.",
    "content": "The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog. The quick brown.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown. The quick brown. The quick brown fox.\n\nThe quick brown. The quick brown fox jumps over. The quick brown fox jumps over.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy. The quick brown fox jumps.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown. The quick brown fox jumps over. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy. The quick brown fox jumps.\n\nThe quick brown. The quick brown fox. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown. The quick brown fox jumps. The quick brown.\n\nThe quick brown fox jumps over lazy. The quick brown fox. The quick brown fox jumps over.",
    "author": "Jane Smith",
    "publishedAt": "2025-10-01T08:32:37.753Z",
    "image": "https://via.placeholder.com/800x400/433aa6/FFFFFF?text=The%20quick%20brown%20fox.",
    "category": "news",
    "tags": [
      "cloud",
      "testing",
      "design"
    ],
    "views": 5282,
    "likes": 212
  },
  {
    "id": "e9116b01-31c5-4355-8ea7-e6841785146c",
    "title": "The quick brown fox jumps over lazy.",
    "slug": "the-quick-brown-fox-jumps-over-lazy",
    "excerpt": "The quick brown. The quick brown fox jumps over.",
    "content": "The quick brown fox. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox. The quick brown fox. The quick brown.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.\n\nThe quick brown fox. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown. The quick brown fox jumps. The quick brown fox jumps over lazy.\n\nThe quick brown. The quick brown fox. The quick brown fox.\n\nThe quick brown fox jumps over lazy. The quick brown. The quick brown fox jumps.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps. The quick brown.\n\nThe quick brown. The quick brown. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy. The quick brown.",
    "author": "Bob Wilson",
    "publishedAt": "2024-12-18T01:21:10.071Z",
    "image": "https://via.placeholder.com/800x400/12bbc9/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "ai-llm-rag",
    "tags": [
      "testing",
      "mongodb",
      "design",
      "api"
    ],
    "views": 4916,
    "likes": 119
  },
  {
    "id": "7cd6f7f3-e653-4469-95ae-216386cdc780",
    "title": "The quick brown fox jumps.",
    "slug": "the-quick-brown-fox-jumps",
    "excerpt": "The quick brown fox jumps over lazy. The quick brown fox.",
    "content": "The quick brown fox jumps over lazy dog. The quick brown fox. The quick brown fox jumps.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over. The quick brown.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over. The quick brown.\n\nThe quick brown. The quick brown fox jumps over. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy dog. The quick brown. The quick brown fox.\n\nThe quick brown fox jumps over. The quick brown fox jumps. The quick brown fox jumps.\n\nThe quick brown fox. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown fox jumps. The quick brown.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown.\n\nThe quick brown fox jumps over. The quick brown fox jumps over. The quick brown fox jumps over.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy. The quick brown.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy dog. The quick brown.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy. The quick brown fox.",
    "author": "Bob Wilson",
    "publishedAt": "2025-03-08T10:09:56.672Z",
    "image": "https://via.placeholder.com/800x400/a79915/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "frontend-backend",
    "tags": [
      "devops",
      "security",
      "cloud",
      "testing"
    ],
    "views": 3541,
    "likes": 246
  },
  {
    "id": "568d4489-9526-4d32-82ac-2e87ba0f154a",
    "title": "The quick brown fox jumps over lazy.",
    "slug": "the-quick-brown-fox-jumps-over-lazy",
    "excerpt": "The quick brown fox. The quick brown fox jumps over lazy.",
    "content": "The quick brown fox jumps over lazy. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown fox. The quick brown fox jumps over lazy.\n\nThe quick brown fox. The quick brown fox. The quick brown fox jumps.\n\nThe quick brown fox. The quick brown fox. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over. The quick brown fox. The quick brown.\n\nThe quick brown fox. The quick brown fox. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over. The quick brown fox jumps. The quick brown.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy.\n\nThe quick brown fox. The quick brown fox. The quick brown.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox. The quick brown fox jumps. The quick brown fox.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps. The quick brown fox jumps.",
    "author": "John Doe",
    "publishedAt": "2024-05-25T14:18:24.076Z",
    "image": "https://via.placeholder.com/800x400/5f73a7/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "databases",
    "tags": [
      "mongodb",
      "backend",
      "cloud",
      "design"
    ],
    "views": 8775,
    "likes": 26
  },
  {
    "id": "b32f45fc-1708-40fa-9732-ab7dfa054c2c",
    "title": "The quick brown fox jumps over.",
    "slug": "the-quick-brown-fox-jumps-over",
    "excerpt": "The quick brown. The quick brown fox jumps over lazy dog.",
    "content": "The quick brown fox jumps over. The quick brown fox jumps. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps. The quick brown fox jumps.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.\n\nThe quick brown. The quick brown fox jumps. The quick brown fox jumps.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over. The quick brown.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown fox jumps over. The quick brown fox jumps. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps. The quick brown fox jumps over. The quick brown fox jumps over lazy dog.\n\nThe quick brown. The quick brown fox jumps. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy. The quick brown fox. The quick brown.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps. The quick brown fox jumps over lazy.\n\nThe quick brown. The quick brown fox jumps over. The quick brown fox jumps.",
    "author": "Alice Johnson",
    "publishedAt": "2024-03-28T17:26:50.339Z",
    "image": "https://via.placeholder.com/800x400/dcb75a/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "ai-llm-rag",
    "tags": [
      "mongodb",
      "machine-learning",
      "security",
      "testing"
    ],
    "views": 4446,
    "likes": 24
  },
  {
    "id": "872ea824-7d74-4bf6-beb9-73b77e9c8e37",
    "title": "The quick brown fox jumps over.",
    "slug": "the-quick-brown-fox-jumps-over",
    "excerpt": "The quick brown fox. The quick brown fox jumps over.",
    "content": "The quick brown fox jumps. The quick brown. The quick brown.\n\nThe quick brown fox jumps. The quick brown fox jumps over. The quick brown fox jumps over.\n\nThe quick brown fox jumps over. The quick brown fox jumps. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown fox jumps over. The quick brown. The quick brown fox.\n\nThe quick brown fox jumps. The quick brown fox jumps. The quick brown fox jumps over lazy.\n\nThe quick brown fox. The quick brown fox jumps over lazy. The quick brown.\n\nThe quick brown fox jumps. The quick brown fox. The quick brown.\n\nThe quick brown fox jumps. The quick brown. The quick brown fox jumps over.\n\nThe quick brown fox jumps over. The quick brown. The quick brown fox jumps over.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown fox.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown fox. The quick brown fox jumps. The quick brown fox jumps over lazy.",
    "author": "Bob Wilson",
    "publishedAt": "2024-08-20T19:38:42.281Z",
    "image": "https://via.placeholder.com/800x400/660b2a/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "databases",
    "tags": [
      "ai",
      "api",
      "database"
    ],
    "views": 1665,
    "likes": 312
  },
  {
    "id": "fca35015-d8cd-49fc-9d3b-918da88de718",
    "title": "The quick brown.",
    "slug": "the-quick-brown",
    "excerpt": "The quick brown fox jumps over lazy dog. The quick brown fox jumps.",
    "content": "The quick brown fox jumps over lazy. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown fox. The quick brown. The quick brown fox jumps over lazy.\n\nThe quick brown fox. The quick brown fox jumps over. The quick brown fox.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox. The quick brown fox.\n\nThe quick brown. The quick brown. The quick brown.\n\nThe quick brown fox jumps. The quick brown fox jumps over. The quick brown fox jumps.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy dog. The quick brown. The quick brown fox.\n\nThe quick brown fox. The quick brown fox jumps. The quick brown fox jumps over lazy.",
    "author": "Bob Wilson",
    "publishedAt": "2025-03-03T13:50:04.337Z",
    "image": "https://via.placeholder.com/800x400/72ba4e/FFFFFF?text=The%20quick%20brown.",
    "category": "news",
    "tags": [
      "react",
      "testing",
      "performance",
      "devops"
    ],
    "views": 9461,
    "likes": 272
  },
  {
    "id": "a4bdde8c-e3e8-4d32-aad3-5e8e0f7fc520",
    "title": "The quick brown fox.",
    "slug": "the-quick-brown-fox",
    "excerpt": "The quick brown fox jumps over lazy. The quick brown fox jumps over.",
    "content": "The quick brown fox. The quick brown fox jumps over. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over. The quick brown. The quick brown fox jumps over.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown fox jumps.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps. The quick brown fox jumps.\n\nThe quick brown fox. The quick brown fox jumps over lazy. The quick brown fox jumps.\n\nThe quick brown fox jumps. The quick brown fox jumps. The quick brown fox jumps.\n\nThe quick brown fox. The quick brown fox. The quick brown fox jumps.\n\nThe quick brown fox jumps over lazy. The quick brown. The quick brown fox jumps over.\n\nThe quick brown fox. The quick brown. The quick brown fox jumps.\n\nThe quick brown fox. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps. The quick brown fox jumps over. The quick brown fox.\n\nThe quick brown. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps. The quick brown fox jumps over lazy.\n\nThe quick brown. The quick brown. The quick brown fox jumps over.",
    "author": "Bob Wilson",
    "publishedAt": "2024-02-12T02:56:53.133Z",
    "image": "https://via.placeholder.com/800x400/c5bad3/FFFFFF?text=The%20quick%20brown%20fox.",
    "category": "frontend-backend",
    "tags": [
      "cloud",
      "mongodb",
      "nextjs",
      "database"
    ],
    "views": 7403,
    "likes": 140
  },
  {
    "id": "9dcfd92d-bd48-437d-a5b2-942c2be70bd0",
    "title": "The quick brown fox jumps over.",
    "slug": "the-quick-brown-fox-jumps-over",
    "excerpt": "The quick brown fox. The quick brown.",
    "content": "The quick brown fox. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.\n\nThe quick brown. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy dog. The quick brown. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy dog. The quick brown. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over. The quick brown fox jumps. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.\n\nThe quick brown fox jumps over. The quick brown. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy.\n\nThe quick brown fox. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy.",
    "author": "Charlie Brown",
    "publishedAt": "2023-12-26T07:42:32.128Z",
    "image": "https://via.placeholder.com/800x400/323112/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "ai-llm-rag",
    "tags": [
      "testing",
      "web-development"
    ],
    "views": 8299,
    "likes": 88
  },
  {
    "id": "c902ceef-01a9-4c39-8abb-823d2a477c01",
    "title": "The quick brown fox jumps over lazy.",
    "slug": "the-quick-brown-fox-jumps-over-lazy",
    "excerpt": "The quick brown fox jumps over lazy. The quick brown fox jumps over.",
    "content": "The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy dog. The quick brown. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over. The quick brown fox jumps.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox. The quick brown fox jumps over lazy dog.",
    "author": "Charlie Brown",
    "publishedAt": "2024-04-28T03:21:13.547Z",
    "image": "https://via.placeholder.com/800x400/896c3e/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "databases",
    "tags": [
      "devops",
      "performance",
      "security"
    ],
    "views": 9908,
    "likes": 393
  },
  {
    "id": "b6922351-c605-4c4b-898c-822e25bb000b",
    "title": "The quick brown.",
    "slug": "the-quick-brown",
    "excerpt": "The quick brown fox jumps. The quick brown fox jumps.",
    "content": "The quick brown fox. The quick brown. The quick brown fox.\n\nThe quick brown fox jumps over. The quick brown fox. The quick brown.\n\nThe quick brown. The quick brown. The quick brown fox.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy. The quick brown.\n\nThe quick brown fox jumps over. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown fox jumps over. The quick brown. The quick brown fox jumps.\n\nThe quick brown. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy. The quick brown.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown.\n\nThe quick brown. The quick brown fox jumps over. The quick brown fox jumps.\n\nThe quick brown. The quick brown. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy. The quick brown fox.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.\n\nThe quick brown. The quick brown. The quick brown fox jumps over.",
    "author": "Jane Smith",
    "publishedAt": "2024-03-27T01:34:45.541Z",
    "image": "https://via.placeholder.com/800x400/7361db/FFFFFF?text=The%20quick%20brown.",
    "category": "web-development",
    "tags": [
      "backend",
      "design",
      "web-development"
    ],
    "views": 8913,
    "likes": 219
  },
  {
    "id": "d9705170-0124-4c57-834f-180fb642d255",
    "title": "The quick brown fox.",
    "slug": "the-quick-brown-fox",
    "excerpt": "The quick brown fox jumps over. The quick brown fox jumps.",
    "content": "The quick brown fox jumps over lazy dog. The quick brown fox jumps over. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy. The quick brown fox.\n\nThe quick brown. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog.\n\nThe quick brown. The quick brown fox. The quick brown fox jumps over lazy.\n\nThe quick brown. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown fox. The quick brown fox jumps. The quick brown.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown fox.",
    "author": "Alice Johnson",
    "publishedAt": "2023-12-07T01:53:33.973Z",
    "image": "https://via.placeholder.com/800x400/179e8c/FFFFFF?text=The%20quick%20brown%20fox.",
    "category": "web-development",
    "tags": [
      "javascript",
      "mongodb"
    ],
    "views": 1676,
    "likes": 450
  },
  {
    "id": "8e654dc3-859d-4636-87de-c3b527af5160",
    "title": "The quick brown fox jumps over lazy.",
    "slug": "the-quick-brown-fox-jumps-over-lazy",
    "excerpt": "The quick brown fox jumps over. The quick brown fox.",
    "content": "The quick brown fox jumps over lazy dog. The quick brown. The quick brown fox jumps over.\n\nThe quick brown fox jumps over. The quick brown fox jumps over. The quick brown fox jumps.\n\nThe quick brown fox jumps. The quick brown. The quick brown.\n\nThe quick brown fox. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy.",
    "author": "Jane Smith",
    "publishedAt": "2025-09-07T23:34:12.871Z",
    "image": "https://via.placeholder.com/800x400/e7883c/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "databases",
    "tags": [
      "web-development",
      "mongodb",
      "frontend",
      "react"
    ],
    "views": 8052,
    "likes": 262
  },
  {
    "id": "d1a30018-9b5f-47fc-a79f-2cbe9b17d9a6",
    "title": "The quick brown fox jumps over lazy.",
    "slug": "the-quick-brown-fox-jumps-over-lazy",
    "excerpt": "The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.",
    "content": "The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown fox jumps over. The quick brown fox jumps over. The quick brown.\n\nThe quick brown fox. The quick brown fox jumps. The quick brown fox.\n\nThe quick brown fox. The quick brown fox. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox. The quick brown fox jumps over. The quick brown fox jumps over lazy.\n\nThe quick brown fox. The quick brown. The quick brown fox jumps over lazy.\n\nThe quick brown fox. The quick brown fox jumps. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over. The quick brown fox jumps.",
    "author": "Jane Smith",
    "publishedAt": "2023-12-02T21:16:26.438Z",
    "image": "https://via.placeholder.com/800x400/6a6ed2/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "news",
    "tags": [
      "database",
      "devops",
      "frontend",
      "web-development",
      "nextjs"
    ],
    "views": 208,
    "likes": 379
  },
  {
    "id": "3c6a7645-e4ca-43cc-ae42-ae445a132e36",
    "title": "The quick brown fox.",
    "slug": "the-quick-brown-fox",
    "excerpt": "The quick brown. The quick brown fox.",
    "content": "The quick brown fox. The quick brown fox jumps over lazy. The quick brown fox.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox. The quick brown fox jumps over lazy. The quick brown.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog. The quick brown.\n\nThe quick brown. The quick brown. The quick brown fox.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown fox jumps over lazy. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy. The quick brown fox jumps.\n\nThe quick brown fox jumps. The quick brown fox jumps over. The quick brown fox jumps.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy. The quick brown fox. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy dog. The quick brown. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox. The quick brown fox.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown.",
    "author": "Bob Wilson",
    "publishedAt": "2025-06-11T14:32:57.751Z",
    "image": "https://via.placeholder.com/800x400/4e39cb/FFFFFF?text=The%20quick%20brown%20fox.",
    "category": "databases",
    "tags": [
      "design",
      "performance",
      "web-development"
    ],
    "views": 5513,
    "likes": 55
  },
  {
    "id": "264fe60b-ed9d-457d-b60b-1a85d086e8e4",
    "title": "The quick brown fox jumps over lazy.",
    "slug": "the-quick-brown-fox-jumps-over-lazy",
    "excerpt": "The quick brown. The quick brown fox jumps over.",
    "content": "The quick brown fox jumps. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps. The quick brown fox jumps over. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy. The quick brown fox. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox. The quick brown fox.\n\nThe quick brown fox. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown fox jumps over. The quick brown fox jumps. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over. The quick brown fox jumps. The quick brown fox.",
    "author": "Bob Wilson",
    "publishedAt": "2024-02-01T00:00:09.899Z",
    "image": "https://via.placeholder.com/800x400/27092a/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "news",
    "tags": [
      "cloud",
      "mongodb",
      "web-development"
    ],
    "views": 1911,
    "likes": 385
  },
  {
    "id": "5b949e74-7441-4a8d-a52e-5eddfb655d67",
    "title": "The quick brown fox.",
    "slug": "the-quick-brown-fox",
    "excerpt": "The quick brown fox jumps over. The quick brown fox jumps.",
    "content": "The quick brown fox. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.\n\nThe quick brown. The quick brown fox jumps. The quick brown fox jumps.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox. The quick brown fox jumps.\n\nThe quick brown fox. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over. The quick brown fox jumps. The quick brown fox jumps.\n\nThe quick brown fox. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown.\n\nThe quick brown fox jumps. The quick brown. The quick brown fox.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown. The quick brown fox jumps over lazy dog. The quick brown fox.",
    "author": "John Doe",
    "publishedAt": "2025-04-09T06:19:32.468Z",
    "image": "https://via.placeholder.com/800x400/49ecb5/FFFFFF?text=The%20quick%20brown%20fox.",
    "category": "news",
    "tags": [
      "api",
      "ai",
      "testing"
    ],
    "views": 4258,
    "likes": 393
  },
  {
    "id": "21b6f050-852f-4273-a440-a814e5bf1cac",
    "title": "The quick brown fox jumps over lazy dog.",
    "slug": "the-quick-brown-fox-jumps-over-lazy-dog",
    "excerpt": "The quick brown fox jumps over. The quick brown fox jumps over.",
    "content": "The quick brown fox jumps over. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown. The quick brown fox. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown fox. The quick brown fox.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.\n\nThe quick brown. The quick brown fox jumps over. The quick brown fox jumps over.",
    "author": "Bob Wilson",
    "publishedAt": "2024-04-09T03:41:13.025Z",
    "image": "https://via.placeholder.com/800x400/509129/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "ai-llm-rag",
    "tags": [
      "javascript",
      "web-development"
    ],
    "views": 825,
    "likes": 116
  },
  {
    "id": "d7ef9f7f-e882-41d9-8b7b-8abaf91b25be",
    "title": "The quick brown fox jumps over lazy.",
    "slug": "the-quick-brown-fox-jumps-over-lazy",
    "excerpt": "The quick brown fox. The quick brown fox jumps over lazy dog.",
    "content": "The quick brown fox. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over. The quick brown fox. The quick brown fox jumps.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps. The quick brown fox jumps over lazy dog.\n\nThe quick brown. The quick brown fox. The quick brown fox jumps over lazy.\n\nThe quick brown fox. The quick brown fox jumps. The quick brown.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown fox. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.\n\nThe quick brown. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy. The quick brown fox. The quick brown.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.",
    "author": "Charlie Brown",
    "publishedAt": "2025-08-11T01:27:34.600Z",
    "image": "https://via.placeholder.com/800x400/7e4d70/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "news",
    "tags": [
      "frontend",
      "design",
      "performance",
      "testing"
    ],
    "views": 4456,
    "likes": 26
  },
  {
    "id": "9b969404-f2f0-440f-826b-00b341ebd470",
    "title": "The quick brown fox jumps.",
    "slug": "the-quick-brown-fox-jumps",
    "excerpt": "The quick brown fox jumps. The quick brown.",
    "content": "The quick brown fox jumps over lazy. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown fox. The quick brown fox jumps over. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over. The quick brown. The quick brown.\n\nThe quick brown fox jumps over. The quick brown. The quick brown.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy.",
    "author": "John Doe",
    "publishedAt": "2024-08-08T06:49:05.013Z",
    "image": "https://via.placeholder.com/800x400/40eb21/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "ai-llm-rag",
    "tags": [
      "backend",
      "database",
      "ai",
      "typescript",
      "api"
    ],
    "views": 871,
    "likes": 436
  },
  {
    "id": "44d0eb6e-57bf-4ebb-9380-e4cec30364af",
    "title": "The quick brown fox jumps.",
    "slug": "the-quick-brown-fox-jumps",
    "excerpt": "The quick brown fox jumps over lazy dog. The quick brown fox.",
    "content": "The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown fox. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox. The quick brown fox jumps over. The quick brown fox jumps over lazy.\n\nThe quick brown. The quick brown fox jumps over. The quick brown fox jumps.\n\nThe quick brown. The quick brown fox jumps over. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy. The quick brown fox.\n\nThe quick brown fox jumps over. The quick brown fox. The quick brown fox.\n\nThe quick brown. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps. The quick brown fox jumps over. The quick brown fox.\n\nThe quick brown fox jumps over lazy dog. The quick brown. The quick brown fox jumps over.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.\n\nThe quick brown. The quick brown fox jumps. The quick brown fox jumps over lazy dog.",
    "author": "Jane Smith",
    "publishedAt": "2024-07-24T08:57:29.363Z",
    "image": "https://via.placeholder.com/800x400/67a9ec/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "frontend-backend",
    "tags": [
      "performance",
      "machine-learning"
    ],
    "views": 9588,
    "likes": 428
  },
  {
    "id": "6c23f3de-2c6b-4bff-a52b-3beb7aabfb21",
    "title": "The quick brown.",
    "slug": "the-quick-brown",
    "excerpt": "The quick brown fox jumps over lazy dog. The quick brown fox jumps over.",
    "content": "The quick brown fox jumps over. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown. The quick brown. The quick brown fox jumps.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy. The quick brown fox.\n\nThe quick brown. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps. The quick brown fox jumps over. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog.",
    "author": "Jane Smith",
    "publishedAt": "2024-07-20T19:39:42.707Z",
    "image": "https://via.placeholder.com/800x400/af3191/FFFFFF?text=The%20quick%20brown.",
    "category": "news",
    "tags": [
      "javascript",
      "design",
      "react"
    ],
    "views": 1192,
    "likes": 285
  },
  {
    "id": "ce10b6df-23b5-450f-91b5-ba008970579d",
    "title": "The quick brown.",
    "slug": "the-quick-brown",
    "excerpt": "The quick brown fox jumps over lazy. The quick brown fox jumps.",
    "content": "The quick brown fox jumps over lazy. The quick brown fox jumps over. The quick brown fox.\n\nThe quick brown fox. The quick brown fox jumps. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over. The quick brown.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy. The quick brown.\n\nThe quick brown fox jumps. The quick brown. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown. The quick brown. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog. The quick brown.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown. The quick brown. The quick brown fox.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.",
    "author": "Alice Johnson",
    "publishedAt": "2024-01-31T00:14:16.609Z",
    "image": "https://via.placeholder.com/800x400/a50597/FFFFFF?text=The%20quick%20brown.",
    "category": "frontend-backend",
    "tags": [
      "mongodb",
      "react",
      "frontend"
    ],
    "views": 9477,
    "likes": 487
  },
  {
    "id": "d2970e13-d807-4b9e-bc2a-585eaebe7b49",
    "title": "The quick brown fox jumps over lazy dog.",
    "slug": "the-quick-brown-fox-jumps-over-lazy-dog",
    "excerpt": "The quick brown fox. The quick brown fox.",
    "content": "The quick brown fox. The quick brown fox jumps over. The quick brown fox.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown.\n\nThe quick brown. The quick brown fox jumps. The quick brown fox jumps over.\n\nThe quick brown fox. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over. The quick brown fox jumps over lazy.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown.",
    "author": "John Doe",
    "publishedAt": "2024-12-13T16:43:11.370Z",
    "image": "https://via.placeholder.com/800x400/27c54c/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "news",
    "tags": [
      "design",
      "nextjs",
      "machine-learning",
      "cloud"
    ],
    "views": 3587,
    "likes": 135
  },
  {
    "id": "1b2463bc-da5d-4123-b04b-04c4074c793a",
    "title": "The quick brown.",
    "slug": "the-quick-brown",
    "excerpt": "The quick brown. The quick brown fox jumps over lazy dog.",
    "content": "The quick brown fox jumps over lazy. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown. The quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy. The quick brown. The quick brown fox jumps over lazy.\n\nThe quick brown fox. The quick brown fox jumps over. The quick brown fox.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps. The quick brown fox.\n\nThe quick brown. The quick brown fox. The quick brown fox.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over. The quick brown fox.\n\nThe quick brown fox jumps. The quick brown. The quick brown fox.\n\nThe quick brown fox jumps over lazy. The quick brown. The quick brown fox jumps.",
    "author": "Alice Johnson",
    "publishedAt": "2024-11-19T00:55:24.240Z",
    "image": "https://via.placeholder.com/800x400/a1a49/FFFFFF?text=The%20quick%20brown.",
    "category": "news",
    "tags": [
      "react",
      "backend",
      "typescript",
      "api",
      "devops"
    ],
    "views": 8314,
    "likes": 406
  },
  {
    "id": "56e50b8b-6880-4f80-9d6e-0b45ca58cc39",
    "title": "The quick brown fox jumps over.",
    "slug": "the-quick-brown-fox-jumps-over",
    "excerpt": "The quick brown. The quick brown fox jumps over lazy.",
    "content": "The quick brown fox jumps over. The quick brown fox jumps over. The quick brown.\n\nThe quick brown fox. The quick brown fox jumps over lazy. The quick brown fox.\n\nThe quick brown fox. The quick brown fox jumps over lazy. The quick brown fox.\n\nThe quick brown fox. The quick brown. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over lazy dog. The quick brown.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.\n\nThe quick brown fox jumps over. The quick brown fox. The quick brown fox jumps over lazy dog.",
    "author": "Jane Smith",
    "publishedAt": "2024-04-13T11:21:32.662Z",
    "image": "https://via.placeholder.com/800x400/8e6ad5/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "news",
    "tags": [
      "database",
      "typescript",
      "api",
      "design"
    ],
    "views": 3724,
    "likes": 352
  },
  {
    "id": "de98b53d-cf30-4254-9a89-96991bfd228b",
    "title": "The quick brown.",
    "slug": "the-quick-brown",
    "excerpt": "The quick brown fox jumps over lazy dog. The quick brown.",
    "content": "The quick brown. The quick brown. The quick brown.\n\nThe quick brown fox. The quick brown. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown. The quick brown fox. The quick brown.\n\nThe quick brown. The quick brown fox. The quick brown.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps. The quick brown fox jumps.\n\nThe quick brown. The quick brown. The quick brown fox.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over. The quick brown fox jumps.\n\nThe quick brown. The quick brown fox jumps. The quick brown fox jumps over.",
    "author": "John Doe",
    "publishedAt": "2024-08-11T07:48:46.193Z",
    "image": "https://via.placeholder.com/800x400/e16aad/FFFFFF?text=The%20quick%20brown.",
    "category": "news",
    "tags": [
      "testing",
      "machine-learning"
    ],
    "views": 9832,
    "likes": 148
  },
  {
    "id": "618ea08e-a228-43f9-9dd3-3c7a56c21aea",
    "title": "The quick brown.",
    "slug": "the-quick-brown",
    "excerpt": "The quick brown fox jumps over lazy. The quick brown fox jumps.",
    "content": "The quick brown fox. The quick brown fox jumps over. The quick brown fox.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over. The quick brown fox jumps over. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps. The quick brown fox jumps over. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps. The quick brown fox jumps over. The quick brown fox jumps over lazy.\n\nThe quick brown. The quick brown fox jumps over lazy dog. The quick brown fox jumps.\n\nThe quick brown fox jumps. The quick brown fox. The quick brown.\n\nThe quick brown. The quick brown fox jumps. The quick brown fox jumps over lazy.\n\nThe quick brown fox. The quick brown fox jumps over. The quick brown fox jumps over lazy.\n\nThe quick brown. The quick brown fox jumps. The quick brown fox jumps over.\n\nThe quick brown fox. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy. The quick brown fox jumps over.\n\nThe quick brown fox. The quick brown. The quick brown fox jumps over lazy.\n\nThe quick brown fox. The quick brown fox jumps over. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over. The quick brown. The quick brown fox.",
    "author": "Bob Wilson",
    "publishedAt": "2025-01-07T21:38:57.570Z",
    "image": "https://via.placeholder.com/800x400/f2096b/FFFFFF?text=The%20quick%20brown.",
    "category": "ai-llm-rag",
    "tags": [
      "design",
      "web-development"
    ],
    "views": 2931,
    "likes": 90
  },
  {
    "id": "fad51e1b-5090-4cb2-aa3f-9a8ba7761243",
    "title": "The quick brown fox.",
    "slug": "the-quick-brown-fox",
    "excerpt": "The quick brown. The quick brown fox jumps over.",
    "content": "The quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over. The quick brown fox.\n\nThe quick brown fox jumps over. The quick brown fox jumps over lazy dog. The quick brown.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox. The quick brown fox jumps over.\n\nThe quick brown fox jumps over. The quick brown fox jumps. The quick brown.",
    "author": "Bob Wilson",
    "publishedAt": "2024-10-23T04:28:38.227Z",
    "image": "https://via.placeholder.com/800x400/84b602/FFFFFF?text=The%20quick%20brown%20fox.",
    "category": "ai-llm-rag",
    "tags": [
      "devops",
      "mongodb",
      "react"
    ],
    "views": 9492,
    "likes": 389
  },
  {
    "id": "311eed79-bd05-4fbd-bc27-a58ef14ae65a",
    "title": "The quick brown fox jumps over lazy dog.",
    "slug": "the-quick-brown-fox-jumps-over-lazy-dog",
    "excerpt": "The quick brown fox jumps over. The quick brown fox.",
    "content": "The quick brown fox. The quick brown. The quick brown fox jumps over lazy dog.\n\nThe quick brown. The quick brown fox jumps over lazy dog. The quick brown fox jumps.\n\nThe quick brown fox jumps over lazy dog. The quick brown. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps. The quick brown fox jumps over lazy dog. The quick brown fox.\n\nThe quick brown. The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy.\n\nThe quick brown fox. The quick brown fox. The quick brown fox jumps.\n\nThe quick brown fox jumps over. The quick brown fox. The quick brown.\n\nThe quick brown fox jumps over lazy dog. The quick brown. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown fox jumps over. The quick brown fox.\n\nThe quick brown fox jumps over lazy. The quick brown fox. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over lazy. The quick brown fox jumps over. The quick brown fox.\n\nThe quick brown. The quick brown fox jumps over. The quick brown fox jumps over.\n\nThe quick brown fox jumps. The quick brown fox jumps over. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps. The quick brown. The quick brown fox jumps over lazy.",
    "author": "Alice Johnson",
    "publishedAt": "2024-11-18T08:18:57.413Z",
    "image": "https://via.placeholder.com/800x400/b184df/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "ai-llm-rag",
    "tags": [
      "design",
      "typescript",
      "mongodb",
      "performance"
    ],
    "views": 4755,
    "likes": 377
  },
  {
    "id": "c99d8dbf-a852-4e78-87c6-a6353cef3413",
    "title": "The quick brown fox jumps.",
    "slug": "the-quick-brown-fox-jumps",
    "excerpt": "The quick brown fox jumps. The quick brown.",
    "content": "The quick brown. The quick brown. The quick brown fox jumps.\n\nThe quick brown fox. The quick brown fox jumps over lazy dog. The quick brown fox jumps over.\n\nThe quick brown. The quick brown fox jumps. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps over. The quick brown fox jumps. The quick brown fox jumps over.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox. The quick brown fox jumps over lazy dog.",
    "author": "Jane Smith",
    "publishedAt": "2024-07-30T05:15:23.571Z",
    "image": "https://via.placeholder.com/800x400/3d6d35/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "frontend-backend",
    "tags": [
      "typescript",
      "performance"
    ],
    "views": 8872,
    "likes": 324
  },
  {
    "id": "ace4fac8-55e8-4468-aef4-264e36fd124b",
    "title": "The quick brown fox jumps over lazy.",
    "slug": "the-quick-brown-fox-jumps-over-lazy",
    "excerpt": "The quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy dog.",
    "content": "The quick brown. The quick brown fox jumps. The quick brown fox jumps over.\n\nThe quick brown. The quick brown fox. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps over lazy dog. The quick brown. The quick brown fox jumps over lazy.\n\nThe quick brown fox jumps. The quick brown fox jumps. The quick brown fox.\n\nThe quick brown fox jumps. The quick brown fox jumps over. The quick brown fox jumps over lazy dog.\n\nThe quick brown fox jumps. The quick brown fox jumps. The quick brown.\n\nThe quick brown fox jumps. The quick brown. The quick brown fox jumps over lazy.\n\nThe quick brown. The quick brown fox jumps. The quick brown fox.\n\nThe quick brown fox. The quick brown fox jumps over lazy. The quick brown.\n\nThe quick brown fox. The quick brown fox jumps over lazy. The quick brown fox jumps.\n\nThe quick brown. The quick brown fox jumps over. The quick brown.\n\nThe quick brown fox jumps over lazy dog. The quick brown fox jumps over lazy. The quick brown fox jumps.",
    "author": "Charlie Brown",
    "publishedAt": "2024-06-27T00:32:10.894Z",
    "image": "https://via.placeholder.com/800x400/9c84fe/FFFFFF?text=The%20quick%20brown%20fox%20",
    "category": "ai-llm-rag",
    "tags": [
      "javascript",
      "react",
      "design",
      "database"
    ],
    "views": 1400,
    "likes": 208
  }
]